Repository: opigno/opigno_tincan_question_type
Catalog: translations/opigno_tincan_question_type.*.po
Languages: de, fr

source: TinCan Package
de: TinCan Packet
fr: Paquet TinCan

source: Question type allowing to integrate a TinCan package inside a lesson.
de: Fragetyp welcher erlaubt TinCan Packte in einer Lektion zu integrieren
fr: Type de question permettant d'intégrer des paquets TinCan au sein d'une leçon

source: About
de: Uber
fr: A propos

source: The Opigno TinCan Question Type module adds a new question type to the quiz module. With this new question type, you will be able to upload a TinCan Package and use it as a question inside a lesson. More information can be found on the !module_page.
de: Das Opigno Modul TinCan Fragetyp erlaubt ein neuer Fragetyp zum Quiz hinzuzufügen. Dieser neuer Fragetyp erlaubt das Laden von TinCan Paketen in einer Lektion. Mehr Informationen dazu auf der !module_page
fr: Le module Opigno TinCan Question Type permet d'ajouter un nouveau type de question au module quiz. Ce nouveau type de question permettra de charger des paquets TinCan au sein de leçons. Plus d'informations sur trouvent sur la !module_pag

source: module page
de: Modulseite
fr: page du module

source: Uses
de: Verwendung
fr: Cas d'emploi

source: Create a new question
de: Neue Frage anlegen
fr: Créer une nouvelle question

source: When you create a new question, you will be able to choose the TinCan Package type of question. Then, you will be asked to choose a title and to upload a TinCan Package. You can find some on the !tincan_packages_site.
de: Beim Anlegen einer neuen Frage können Sie den Typ des TinCan Paketes wählen. Sie müssen anschliessend einen Titel wählen und das TinCan Paket laden. Sie finden welche auf der !tincan_packages_site.
fr: Lorsque vous créerez une nouvelle question, vous aurez la possibilit de choisir le type Paquet TinCan. Vous devrez ensuite choisir un titre et charger un paquet TinCan. Vous pouvez en trouver quelques uns sur le !tincan_packages_site.

source: TinCan Website
de: TinCan Webseite
fr: Site internet TinCan

source: Answer a TinCan Question
de: TinCan Fragetyp beantworten
fr: Répondre à un type de question TinCan

source: To answer a TinCan Question, you just have to start the lesson that contains the question previously created. The TinCan Package will appear in an iFrame.
de: Um eine TinCan Frage zu beantworten, reicht es die Lektion zu starten welche die Frage beinhaltet. Das TinCan Paket erscheint im iFrame
fr: Pour répondre à une question TinCan, il suffit de débuter la leçon contenant la question précédemment créée. Le paquet TinCan apparaitra au sein d'une iframe.

source: Get the score
de: Den Score erhalten
fr: Obtenir le score

source: The score is taken directly from the LRS. The TinCan Package must provide the score in the way described in the README.md file or on the !module_page to the LRS. Then, this module will get the score back from the LRS and register it to this Opigno LMS instance.
de: Der Score wird vom LRS übernommen. Das TinCan Paket muss den Score dem LRS liefern via der Datei README.md oder via der !module_page. Dieses Modul empfängt den Score vom LRS und speichert diesen lokal in die Opigno LMS Instanz.
fr: Le score est directement récupéré depuis le LRS. Le paquet TinCan doit fournir le score au LRS de la manière décrite dans le fichier README.md ou sur la !module_page. Puis, ce module va récupérer le score du LRS et l'enregistrer localement sur l'instance Opigno LMS.

source: TinCan Package specifications
de: TinCan Paket Spezifikationen
fr: Spécifications du paquet TinCan

source: The TinCan Package must follow, at least, the specifications written in the README.md file or on the !module_page. A good TinCan Package should follow the specifications written on the official !github_page.
de: Das TinCan Paket muss mindestens den Spezifikationen folgen, welche in der README.MD Datei oder auf der !module_page beschrieben sind. Ein korrekt konfiguriertes TinCan Paket sollte den Spezifikationen folgen die auf der !github_page beschrieben sind.
fr: Le paquet TinCan doit au moins respecter les spécifications décrites dans le fichier README.md ou sur la !module_page. Un paquet TinCan correctement configuré devrait suivre les spécifications écrites sur la !github_page.

source: Error while uploading the file.
de: Fehler beim Laden der Datei
fr: Erreur lors du chargement du fichier.

source: Error while opening the file.
de: Fehler beim öffnen der Datei.
fr: Erreur lors de l'ouverture du fichier.

source: The package does not contain an activity ID or a launch file
de: Das Paket beinhaltet keine Aktivität ID oder initialisierungsdatei
fr: Le paquet ne contient pas une ID d'activité ou un fichier de démarrage

source: The package does not contain the activity ID or the launch file
de: Das Paket beinhaltet keine Aktivität ID oder initialisierungsdatei
fr: Le paquet ne contient pas l'ID d'activité ou le fichier de démarrage

source: Unable to open the archive
de: Unmöglich das Archiv zu öffnen
fr: Impossible d'ouvrir l'archive

source: Tincan package description
de: Tincan Paketbeschreibung
fr: Description du paquet TinCan

source: The module Opigno TinCan API is not configured. Go to !url
de: Das Opigno TinCan API ist nicht konfiguriert. Gehen Sie zu !url
fr: Le module Opigno TinCan API n'est pas configuré. Veuillez visiter !url

source: the settings page.
de: Konfigurationsseite.
fr: la page de configuration.

source: Connection to the LRS failed
de: LRS Verbindung ist misslungen
fr: La connexion au LRS a échoué

source: There was an error while answering the question, please go back and try again.
de: Ein Fehler ist aufgetreten während dem Beantworten der Frage, gehen Sie bitte zurück und versuchen Sie es erneut.
fr: Une erreur a été rencontrée lors de la réponse à la question, veuillez revenir en arrière et réessayer.

source: Error while obtaining the activity ID. Maybe a malformed TinCan package.
de: Fehler beim Empfangen der Aktivität ID. Das TinCan Paket ist vielleicht unkorrekt konfiguriert.
fr: Erreur lors de la récupération de l'ID d'activité. Le paquet TinCan est peut-être configuré de façon incorrecte.

source: Please configure first the Opigno TinCan API module.
de: Bitte konfigurieren Sie erst das Opigno TinCan API Modul.
fr: Veuillez d'abord configurer le module Opigno TinCan API.

source: Go to !url
de: Besuchen Sie !url
fr: Veuillez visiter !url

source: Please install the !tincanphp_library in the sites/all/library/TinCanPHP folder.
de: Bitte !tincanphp_library im Directory sites/all/library/TinCanPHP installieren
fr: Veuillez installer la !tincanphp_library dans le répertoire sites/all/library/TinCanPHP.

source: TinCanPHP library
fr: Librairie TinCanPHP

source: You will not be able to save this question.
fr: Vous ne pourrez pas sauvegarder cette question.

source: Impossible to create a new TinCan Package question type.
fr: Impossible de créer un nouveau type de question Paquet TinCan.
